backend: tensorflow
class_name: Sequential
config:
- class_name: Lambda
  config:
    arguments: {}
    batch_input_shape: !!python/tuple [null, 180, 240, 1]
    dtype: float32
    function: !!python/tuple ['4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07p/wAAAGcAAAAAAADgP6kA

        KQHaAXhyAgAAAHICAAAA+i8vaG9tZS9lZWIwMi9naXQvamV0c29uLWNhci9kYXRhL21vZGVsL0Rh

        dE5ldC5wedoIPGxhbWJkYT7SAAAA8wAAAAA=

        ', null, null]
    function_type: lambda
    name: lambda_2
    output_shape: null
    output_shape_type: raw
    trainable: true
- class_name: Cropping2D
  config:
    cropping: !!python/tuple
    - !!python/tuple [30, 0]
    - !!python/tuple [0, 0]
    data_format: channels_last
    name: cropping2d_2
    trainable: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    filters: 24
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_6
    padding: same
    strides: !!python/tuple [2, 2]
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 36
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_7
    padding: same
    strides: !!python/tuple [2, 2]
    trainable: true
    use_bias: true
- class_name: SpatialDropout2D
  config: {name: spatial_dropout2d_5, noise_shape: null, rate: 0.2, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 48
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_8
    padding: valid
    strides: !!python/tuple [2, 2]
    trainable: true
    use_bias: true
- class_name: SpatialDropout2D
  config: {name: spatial_dropout2d_6, noise_shape: null, rate: 0.2, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_9
    padding: valid
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: SpatialDropout2D
  config: {name: spatial_dropout2d_7, noise_shape: null, rate: 0.2, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_10
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: SpatialDropout2D
  config: {name: spatial_dropout2d_8, noise_shape: null, rate: 0.2, seed: null, trainable: true}
- class_name: Flatten
  config: {name: flatten_2, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_5
    trainable: true
    units: 100
    use_bias: true
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_6
    trainable: true
    units: 50
    use_bias: true
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_7
    trainable: true
    units: 10
    use_bias: true
- class_name: Dropout
  config: {name: dropout_2, noise_shape: null, rate: 0.5, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_8
    trainable: true
    units: 1
    use_bias: true
keras_version: 2.1.2
