{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_2", "output_shape_type": "raw", "dtype": "float32", "output_shape": null, "batch_input_shape": [null, 180, 240, 1], "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07p/wAAAGcAAAAAAADgP6kA\nKQHaAXhyAgAAAHICAAAA+i8vaG9tZS9lZWIwMi9naXQvamV0c29uLWNhci9kYXRhL21vZGVsL0Rh\ndE5ldC5wedoIPGxhbWJkYT7SAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "trainable": true}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_2", "trainable": true, "cropping": [[30, 0], [0, 0]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_6", "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "filters": 24, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_7", "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "filters": 36, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_5", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_8", "padding": "valid", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "filters": 48, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_6", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_9", "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_7", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_10", "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_8", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_5", "activation": "relu", "units": 100, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_6", "activation": "relu", "units": 50, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_7", "activation": "relu", "units": 10, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_8", "activation": "linear", "units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}]}