{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 180, 240, 1], "name": "cifar1", "sparse": false}, "inbound_nodes": [], "name": "cifar1"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAAAgAAAFMAAABzDAAAAHwAAGQBABVkAgAYUygDAAAATmcAAAAAAOBvQGcAAAAAAADg\nPygAAAAAKAEAAAB0BQAAAGltYWdlKAAAAAAoAAAAAHMwAAAAL2hvbWUvam9zZXBoL2dpdC9qZXRz\nb24tY2FyL2RhdGEvbW9kZWwvRGF0TmV0LnB5dAgAAAA8bGFtYmRhPpwAAAB0AAAAAA==\n", null, null], "name": "lambda_3", "dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 180, 240, 1], "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["cifar1", 0, 0, {}]]], "name": "lambda_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]], "name": "conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "relu0"}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_7"}, "inbound_nodes": [[["relu0", 0, 0, {}]]], "name": "dropout_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bnF", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "bnF"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "reluF"}, "inbound_nodes": [[["bnF", 0, 0, {}]]], "name": "reluF"}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_8"}, "inbound_nodes": [[["reluF", 0, 0, {}]]], "name": "dropout_8"}, {"class_name": "AveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "data_format": "channels_last", "pool_size": [90, 90], "padding": "valid", "strides": [90, 90]}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "avg_pool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}, "inbound_nodes": [[["avg_pool", 0, 0, {}]]], "name": "flat"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flat", 0, 0, {}]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_9"}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "dropout_9"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "fc2"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_10"}, "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "dropout_10"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "fc3"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_11"}, "inbound_nodes": [[["fc3", 0, 0, {}]]], "name": "dropout_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "output_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "output_1"}], "input_layers": [["cifar1", 0, 0]], "output_layers": [["output_1", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}